create_clock -period 20.000 -name clk -waveform {0.000 10.000} [get_ports clk]
create_clock -period 250.000 -name jtag_TCK -waveform {0.000 125.000} [get_ports jtag_TCK]
set_property CLOCK_DEDICATED_ROUTE FALSE [get_nets jtag_TCK]
set_false_path -from [get_clocks clk] -to [get_clocks jtag_TCK]
set_false_path -from [get_clocks jtag_TCK] -to [get_clocks clk]
set_false_path -from [get_clocks clk_pll_i] -to [get_clocks jtag_TCK]
set_false_path -from [get_clocks jtag_TCK] -to [get_clocks clk_pll_i]
set_false_path -to [get_ports {gpio_o[7]}]
set_false_path -to [get_ports {gpio_o[6]}]
set_false_path -to [get_ports {gpio_o[5]}]
set_false_path -to [get_ports {gpio_o[4]}]
set_false_path -to [get_ports {gpio_o[3]}]
set_false_path -to [get_ports {gpio_o[2]}]
set_false_path -to [get_ports {gpio_o[1]}]
set_false_path -to [get_ports {gpio_o[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {gpio_o[7]}]
set_property IOSTANDARD LVCMOS33 [get_ports {gpio_o[6]}]
set_property IOSTANDARD LVCMOS33 [get_ports {gpio_o[5]}]
set_property IOSTANDARD LVCMOS33 [get_ports {gpio_o[4]}]
set_property IOSTANDARD LVCMOS33 [get_ports {gpio_o[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {gpio_o[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {gpio_o[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {gpio_o[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports rx]
set_property IOSTANDARD LVCMOS33 [get_ports tx]
set_property IOSTANDARD LVCMOS33 [get_ports clk]
set_property IOSTANDARD LVCMOS33 [get_ports jtag_TCK]
set_property IOSTANDARD LVCMOS33 [get_ports jtag_TDI]
set_property IOSTANDARD LVCMOS33 [get_ports jtag_TDO]
set_property IOSTANDARD LVCMOS33 [get_ports jtag_TMS]
set_property IOSTANDARD LVCMOS33 [get_ports rst]
set_property IOSTANDARD LVCMOS33 [get_ports rst_sys_i]
set_property PACKAGE_PIN G25 [get_ports rst_sys_i]
set_property PACKAGE_PIN D26 [get_ports rst]
set_property PACKAGE_PIN G22 [get_ports clk]
set_property PACKAGE_PIN E25 [get_ports {gpio_o[7]}]
set_property PACKAGE_PIN D25 [get_ports {gpio_o[6]}]
set_property PACKAGE_PIN D24 [get_ports {gpio_o[5]}]
set_property PACKAGE_PIN C26 [get_ports {gpio_o[4]}]
set_property PACKAGE_PIN C24 [get_ports {gpio_o[3]}]
set_property PACKAGE_PIN D23 [get_ports {gpio_o[2]}]
set_property PACKAGE_PIN A24 [get_ports {gpio_o[1]}]
set_property PACKAGE_PIN A23 [get_ports {gpio_o[0]}]
set_property PACKAGE_PIN B17 [get_ports rx]
set_property PACKAGE_PIN A17 [get_ports tx]
set_property PACKAGE_PIN B14 [get_ports jtag_TCK]
set_property PACKAGE_PIN C14 [get_ports jtag_TDI]
set_property PACKAGE_PIN D14 [get_ports jtag_TDO]
set_property PACKAGE_PIN B12 [get_ports jtag_TMS]
create_generated_clock -name clk_uart_tx -source [get_pins ppi_inst/uart_inst/uart_clk1/clk] -divide_by 300 [get_pins ppi_inst/uart_inst/uart_clk1/uart_tx_clk]
create_generated_clock -name clk_uart_rx -source [get_pins ppi_inst/uart_inst/uart_clk1/clk] -divide_by 50 [get_pins ppi_inst/uart_inst/uart_clk1/uart_rx_clk]

set_false_path -from [get_ports rst]
set_false_path -from [get_ports rst_sys_i]

set_multicycle_path -setup -from [get_pins jtag_inst/u_jtag_dm/dm_halt_req_reg/C] 10
set_multicycle_path -hold -from [get_pins jtag_inst/u_jtag_dm/dm_halt_req_reg/C] 9

set_property IOSTANDARD LVCMOS33 [get_ports HDMI_OUT_EN1]
set_property PACKAGE_PIN AE22 [get_ports HDMI_OUT_EN1]
set_property PACKAGE_PIN AC23 [get_ports {TMDS_DATA_P1[2]}]
set_property PACKAGE_PIN AE23 [get_ports {TMDS_DATA_P1[1]}]
set_property PACKAGE_PIN AF24 [get_ports {TMDS_DATA_P1[0]}]
set_property PACKAGE_PIN Y22 [get_ports TMDS_CLK_P1]
set_property IOSTANDARD TMDS_33 [get_ports {TMDS_DATA_P1[2]}]
set_property IOSTANDARD TMDS_33 [get_ports {TMDS_DATA_P1[1]}]
set_property IOSTANDARD TMDS_33 [get_ports {TMDS_DATA_P1[0]}]
set_property IOSTANDARD TMDS_33 [get_ports TMDS_CLK_P1]
